**Data Visualization** <br>

Spring 2022

Ying Zhu <br>
(yzhu@gsu.edu)

# Project 1

(last updated on 1/10/2022)

**Due date: 11:59 pm, 2/1/2022 (Tuesday)**

**Requirements**

- The goal of this project is to help you get familiar with basic data processing using Python and Pandas. This project does not involve data visualization. 

- You must use Python and Pandas. 

- This is an individual project. Each student must submit his/her own work. 

- The three data files used in this project are included in a separate Zip file. All the data files are from [Tableau Public](https://public.tableau.com/en-us/s/resources). Upload these data files to your Colab working directory or the Jupyter Notebook working directory. If you are not sure where your Jupyter working directory is, please read my Notes on Python.

- The best way to do this project is to open this file in Google Colab or Jupyter Notebook, enter your code in the blank cell under each question, and run it. People coming from Java, JavaScript, or C++ background need to get used to Jupyter Notebook where source code cells are interleaved with text cells.

- Submit two things: a text file that contains the link to your Ipynb file in Google Colab (or the Ipynb file itself if you don't use Google Colab) and a PDF printout of your Ipynb file. **Make sure your Ipynb file in Google Colab is shared so that anyone with the link can view.** Do not put this link in public.

- Each of your submitted files should include both source code and output. This will make it easier for my TA and I to check your answers. **Do not submit only the source code without output or the output without the source code.** <br> You can put the two files in a Zip file and submit the Zip file. 

- Do not submit by email.

### Inc5000 Company dataset

Load Inc5000_Company_List_2014.csv and answer the following questions. (40 points)

1. Which company has the most workers? Which company has the least workers? (5 points)

In [3]:
import numpy as np
import pandas as pd
company = pd.read_csv ('Inc5000_Company_List_2014.csv')
company1= company[["company","workers"]]
print('Which Company has most workers?\n')
print(company1[company1.workers == company1.workers.max()])
print('\n\nWhich Company has least workers?\n')
print(company1[company1.workers == company1.workers.min()])

Which Company has most workers?

                            company  workers
2304  Universal Services of America    34219


Which Company has least workers?

                           company  workers
597   MileStone Community Builders        0
1057           Fruitables Pet Food        0
1243        GTN Technical Staffing        0
1635           Subzero Engineering        0
2187                    LabConnect        0
2922          Sorriso Technologies        0
3174                      Phydeaux        0
3344               Health Advocate        0
4125          Automation & Control        0
4407  American Sensor Technologies        0
4521              General Networks        0
4751            Blue Star Partners        0
4827                    Polsinelli        0

2. Which company is on the list for the longest time? (5 points)

In [4]:
import numpy as np
import pandas as pd
company = pd.read_csv ('Inc5000_Company_List_2014.csv')
company1= company[["company","yrs_on_list"]]
print('Which Company is on the list for the longest time?\n')
print(company1[company1.yrs_on_list == company1.yrs_on_list.max()])

Which Company is on the list for the longest time?

     company  yrs_on_list
3820  TriNet           12

3. List the top 10 companies with the highest revenue. (5 points)

In [ ]:
import numpy as np
import pandas as pd
company = pd.read_csv ('Inc5000_Company_List_2014.csv')
company1= company[["company","revenue"]]
highest_revenue = company1.sort_values(by='revenue', ascending=False)
print('List the top 10 Companies with the highest revenue\n')
print(highest_revenue.iloc[0:10])

List the top 10 Companies with the highest revenue

                         company     revenue
2662   Pacific Union Real Estate  5528202691
4949                  ABC Supply  4911166514
3690  Eco-Energy Global Biofuels  4138790000
1982           EnvisionRxOptions  3644869906
256                      Bridger  3487872233
4618          Prime Therapeutics  2511716640
4203               Flyers Energy  1977921907
3425         Sun Coast Resources  1868964476
3240        Carahsoft Technology  1724988401
3820                      TriNet  1644275000

4. Which company in California has the lowest growth? (5 points)

In [ ]:
import numpy as np
import pandas as pd
company = pd.read_csv ('Inc5000_Company_List_2014.csv')
company1= company[["company","state_l","growth"]]
company2=company1.loc[company1["state_l"] == "California"]
lowest_growth = company2.sort_values(by='growth', ascending=True)
print('Which company in California has the lowest growth?\n')
print(lowest_growth.iloc[0:1])

Which company in California has the lowest growth?

     company     state_l  growth
4997  Sensis  California  42.519

5. List the number of companies by state. In other words, create a dataframe with two columns: "state" and "company_count". (5 points)

In [ ]:
import numpy as np
import pandas as pd
company = pd.read_csv ('Inc5000_Company_List_2014.csv')
company1= company[["company","state_l"]]
print('List the number of companies by state\n')
count = company1.groupby(['state_l']).count() # displays all states and no. of companies 
print(count)                                  # in that particular state

List the number of companies by state

                      company
state_l
Alabama                    56
Alaska                      1
Arizona                   104
Arkansas                    9
California                694
Colorado                  122
Connecticut                47
Delaware                   18
District of Columbia       44
Florida                   303
Georgia                   209
Hawaii                      5
Idaho                      12
Illinois                  238
Indiana                    73
Iowa                       30
Kansas                     36
Kentucky                   31
Louisiana                  41
Maine                      14
Maryland                  121
Massachusetts             174
Michigan                  130
Minnesota                  94
Mississippi                12
Missouri                   72
Montana                     5
Nebraska                   28
Nevada                     31
New Hampshire              22
New Jersey                164
New Mexico                  6
New York                  335
North Carolina            146
North Dakota                6
Ohio                      171
Oklahoma                   30
Oregon                     61
Pennsylvania              191
Puerto Rico                 2
Rhode Island               17
South Carolina             55
South Dakota                2
Tennessee                  80
Texas                     404
Utah                       86
Vermont                     3
Virginia                  284
Washington                107
West Virginia               4
Wisconsin                  70

6. List the number of companies by industry. In other words, create a dataframe with two columns: "industry" and "company_count". (5 points)

In [ ]:
import numpy as np
import pandas as pd
company = pd.read_csv ('Inc5000_Company_List_2014.csv')
company1= company[["company","industry"]]
print('List the number of companies by industry\n')
count = company1.groupby(['industry']).count() # displays industry and number of companies related to that
print(count)                                    # particular industry

List the number of companies by industry

                              company
industry
Advertising & Marketing           453
Business Products & Services      435
Computer Hardware                  34
Construction                      198
Consumer Products & Services      230
Education                          78
Energy                            116
Engineering                        66
Environmental Services             54
Financial Services                278
Food & Beverage                   132
Government Services               212
Health                            377
Human Resources                   199
IT Services                       733
Insurance                          67
Logistics & Transportation        132
Manufacturing                     212
Media                              60
Real Estate                       131
Retail                            200
Security                           68
Software                          338
Telecommunications                135
Travel & Hospitality               62

7. List the number of companies by state and then by industry. In other words, create a dataframe with three columns: "state", "industry", and "company_count". (10 points)

In [ ]:
import numpy as np
import pandas as pd
company = pd.read_csv ('Inc5000_Company_List_2014.csv')
company1= company[["company","state_l","industry"]]
print('List the number of companies by state and then industry\n')
print(company1.groupby(["state_l", "industry"]).count()) # displays the count of companies in each state
                                                        # with respect to industry

List the number of companies by state and then industry

                                        company
state_l   industry
Alabama   Business Products & Services        4
          Construction                        2
          Consumer Products & Services        4
          Education                           1
          Energy                              1
...                                         ...
Wisconsin Real Estate                         1
          Retail                              4
          Software                            6
          Telecommunications                  1
          Travel & Hospitality                2

[809 rows x 1 columns]

### Airbnb dataset

Load airbnb.xslx and answer the following questions.

8. Count the number of properties with the word "central park" (not case sensitive) in Name. (5 points)

In [ ]:
import numpy as np
import pandas as pd
airbnb = pd.read_excel ('airbnb.xlsx')
airbnb1 = airbnb["Name"]
print('Count of the properties with the word "central park" is \n')
airbnb1.loc[airbnb1.str.contains('central park|Central Park|Central park|CENTRAL PARK') == True].count()

Count of the properties with the word "central park" is

666

9. How many Manhattan Appartment with Entire home/apt has 3 or more beds? (5 points)

In [5]:
import numpy as np
import pandas as pd
airbnb = pd.read_excel ('airbnb.xlsx')
airbnb1 = airbnb[["Name","Neighbourhood","Room Type","Beds"]]
airbnb2= airbnb1.loc[airbnb1["Neighbourhood"] == "Manhattan"]
airbnb3= airbnb2.loc[airbnb2["Room Type"] == "Entire home/apt"]
airbnb3.loc[airbnb3["Beds"]>= 3] # gives the list of apartments 1552 rows

,Name,Neighbourhood,Room Type,Beds
3,Gorgeous 1 BR with Private Balcony,Manhattan,Entire home/apt,3.0
18,"Priv Apt,Garden,BBQ,A/C,BigTV,for 4",Manhattan,Entire home/apt,3.0
19,Great 3 Bed Apt Tribeca / Soho,Manhattan,Entire home/apt,3.0
28,3 bedroom apartment in Chinatown!,Manhattan,Entire home/apt,4.0
36,Sunny & Bright Harlem Home,Manhattan,Entire home/apt,3.0
...,...,...,...,...
30362,2 Bed 2 Bath-Steps to Central Park!,Manhattan,Entire home/apt,3.0
30365,Time Square Midtown Luxury2BD/2BA,Manhattan,Entire home/apt,3.0
30396,Luxury 2 Bedroom /Sleep 6 / Doorman,Manhattan,Entire home/apt,3.0
30398,Private Patio Midtown Apt Sleep 5,Manhattan,Entire home/apt,3.0
30445,3 Beds near Central Park /Lincoln C,Manhattan,Entire home/apt,3.0

10. List the top three Apartments with Entire home/apt in Manhattan with a Price lower than 400 and Review Scores Rating higher than 90. (Do not use the "Review Scores Rating (bin)" column.) (10 points)

In [146]:
import numpy as np
import pandas as pd
airbnb = pd.read_excel ('airbnb.xlsx')
airbnb1 = airbnb[["Name","Neighbourhood","Room Type","Price","Review Scores Rating"]]
airbnb2= airbnb1.loc[airbnb1["Neighbourhood"] == "Manhattan"]
airbnb3= airbnb2.loc[airbnb2["Room Type"] == "Entire home/apt"]
airbnb4= airbnb3.loc[airbnb3["Price"]<400]
top_three =airbnb4.loc[airbnb4["Review Scores Rating"]>90]
top_three = top_three.sort_values(by='Price', ascending=True)
print('Top three apartments from list with lowest price')
top_three.iloc[0:3]# displays top rated appartment with lowest price

Top three apartments from list with lowest price

,Name,Neighbourhood,Room Type,Price,Review Scores Rating
16203,"Empty, clean apt -Avail for 2 weeks",Manhattan,Entire home/apt,50,100.0
5594,Beautiful Harlem Studio,Manhattan,Entire home/apt,50,98.0
9137,"Comfy apartment, adorable cat!",Manhattan,Entire home/apt,50,92.0

11. List the average property price for each Neighbourhood. In other words, create a dataframe with two columns: "neighbourhood" and "average_price". (10 points)

In [147]:
import numpy as np
import pandas as pd
airbnb = pd.read_excel ('airbnb.xlsx')
airbnb1 = airbnb[["Neighbourhood","Price"]]
print('The average property price for each Neighbourhood.\n')
airbnb1.groupby('Neighbourhood')['Price'].mean()
#df = pd.DataFrame(data, columns=['Neighbourhood', 'Average_Price'])
#airbnb1.groupby(["Neighbourhood", "Price"]).mean()

The average property price for each Neighbourhood.

Neighbourhood
Bronx             94.660870
Brooklyn         129.500471
Manhattan        198.474584
Queens           103.222125
Staten Island    163.462585
Name: Price, dtype: float64

### Summer Olympic Medalists dataset

Load Summer_Olympic_medalists_1896-2008.xslx and answer the following questions. (30 points)

12. From 1980 to 2008, which country won the most medals in Wrestling? (10 points)

In [10]:
import numpy as np
import pandas as pd
olympic = pd.read_excel ('Summer_Olympic_medallists_1896-2008.xlsx')
olympic1= olympic[["Edition","Sport","NOC","Medal"]]
olympic2= olympic1.loc[olympic1["Edition"]>= 1980]
olympic3= olympic2.loc[olympic2["Sport"]== "Wrestling"]
olympic4 = olympic3["NOC"].value_counts()
print('From 1980 to 2008, which country won the most medals in Wrestling? \n')
olympic4[0:1]

From 1980 to 2008, which country won the most medals in Wrestling?

USA    51
Name: NOC, dtype: int64

13. List the number of medals won by USA athletes from 1996 to 2008. In other words, create a dataframe with the following columns: "country", "year", "gold", "silver", "bronze". (10 points)

In [145]:
import numpy as np
import pandas as pd
olympic = pd.read_excel ('Summer_Olympic_medallists_1896-2008.xlsx')
olympic1= olympic[["Edition","NOC","Medal"]]
olympic2= olympic1.loc[olympic1["NOC"]== "USA"]
olympic2= olympic2.loc[olympic2["Edition"]>= 1996]
olympic2= olympic2.groupby(["NOC","Edition", 
                            "Medal"])["Medal"].count()
#olympic4 = olympic3["Medal"].value_counts()
print('The number of medals won by USA athletes from 1996 to 2008. \n')
#df = pd.DataFrame(olympic1, columns=["counyry","year","gold","silver","bronze"])
print(olympic2)

The number of medals won by USA athletes from 1996 to 2008.

NOC  Edition  Medal
USA  1996     Bronze     52
              Gold      160
              Silver     48
     2000     Bronze     52
              Gold      130
              Silver     66
     2004     Bronze     73
              Gold      116
              Silver     75
     2008     Bronze     81
              Gold      125
              Silver    109
Name: Medal, dtype: int64

14. Are there athletes who won medals in three or more different Olympics? If so, print the names, their countries, and the years they won. In other words, create a dataframe with the columns: "athlete", "NOC", "year1", "year2", "year3", "year4", etc. (10 points)

In [150]:
import warnings
warnings.filterwarnings('ignore')

In [152]:
import numpy as np
import pandas as pd
olympic = pd.read_excel ('Summer_Olympic_medallists_1896-2008.xlsx')
olympic= olympic[["Athlete","Edition","NOC"]]
olympic2 = olympic.groupby(by= ['Athlete','NOC'])["Edition"].unique().to_frame(name = 'Years_Won').reset_index()
olympic2["count1"] = np.nan
for i in range(0,len(olympic2)):
    len1 = len(olympic2["Years_Won"][i])
    olympic2["count1"][i] = len1
print('Athletes who won medals in three or more different Olympics. \n')
olympic2.loc[olympic2["count1"]>= 3]
#olympic= olympic.groupby(['Athlete','NOC'])['Edition'].unique()

#olympic.groupby('Edition').unique()

Athletes who won medals in three or more different Olympics.

                   Athlete  NOC           Years_Won  count1
24     ABBAGNALE, Agostino  ITA  [1988, 1996, 2000]     3.0
25      ABBAGNALE, Carmine  ITA  [1984, 1988, 1992]     3.0
26     ABBAGNALE, Giuseppe  ITA  [1984, 1988, 1992]     3.0
33            ABDUL, Hamid  PAK  [1956, 1960, 1964]     3.0
35       ABDUL, Rashid III  PAK  [1968, 1972, 1976]     3.0
...                    ...  ...                 ...     ...
21580    ZIELINSKI, Marian  POL  [1956, 1964, 1968]     3.0
21612         ZIZIC, Rajko  YUG  [1976, 1980, 1984]     3.0
21644     ZSIVOTZKY, Gyula  HUN  [1960, 1964, 1968]     3.0
21646         ZUB, Ryszard  POL  [1956, 1960, 1964]     3.0
21683       ZYBINA, Galina  URS  [1952, 1956, 1964]     3.0

[668 rows x 4 columns]